h200/DeepSeek70B_V1_P2P_8GPU/concurrency_128_prompt_3000.txt
============ Serving Benchmark Result ============
Successful requests:                     3000      
Failed requests:                         0         
Maximum request concurrency:             128       
Benchmark duration (s):                  841.23    
Total input tokens:                      694628    
Total generated tokens:                  1991478   
Request throughput (req/s):              3.57      
Output token throughput (tok/s):         2367.33   
Peak output token throughput (tok/s):    2816.00   
Peak concurrent requests:                193.00    
Total token throughput (tok/s):          3193.06   
---------------Time to First Token----------------
Mean TTFT (ms):                          442.19    
Median TTFT (ms):                        187.87    
P90 TTFT (ms):                           766.64    
P99 TTFT (ms):                           5528.60   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          52.87     
Median TPOT (ms):                        52.90     
P90 TPOT (ms):                           55.03     
P99 TPOT (ms):                           63.60     
---------------Inter-token Latency----------------
Mean ITL (ms):                           52.56     
Median ITL (ms):                         46.25     
P90 ITL (ms):                            54.73     
P99 ITL (ms):                            173.07    
==================================================